In [1]:
import pandas as pd
l = [4, 8, 15, 16, 23, 42]
df = pd.Series(l)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
import random
a = [ random.randint(1,100) for _ in range(10)]
a

[88, 31, 25, 55, 48, 48, 45, 32, 65, 85]

In [3]:
df = pd.Series(a)
df

0    88
1    31
2    25
3    55
4    48
5    48
6    45
7    32
8    65
9    85
dtype: int64

In [4]:
dictionary = {
    "Name" :  ['Alice', 'Bob', 'Claire'],
    "Age" :   [25, 30, 27],
    "Gender": ['Female', 'Male', 'Female']
}

In [5]:
df = pd.DataFrame(dictionary)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Ans: DataFrame is 2-D data or used to describe table like objects, where as series is 1 D data used to describe either row or column.

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
type(df.loc[0])

pandas.core.series.Series

In [8]:
df.loc[[0]] # this data frame

    Name  Age  Gender
0  Alice   25  Female

In [9]:
df.loc[0] # this data series

Name       Alice
Age           25
Gender    Female
Name: 0, dtype: object

In [10]:
df['Name'] # this data series

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [11]:
df[['Name']] # this data frame

     Name
0   Alice
1     Bob
2  Claire

In [12]:
type(df['Name'])

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
Ans: head -> showing top data by default : 5, 
     tail -> showing end data by default : 5, 
     dropna -> delete rows if value of one column is NaN , 
     fillna -> fill with some value if value of one column is NaN etc.

In [13]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [14]:
df.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Ans: Series

In [15]:
ds = df.loc[0]
ds

Name       Alice
Age           25
Gender    Female
Name: 0, dtype: object

In [16]:
ds[1] = 29
ds

C:\Users\santa\AppData\Local\Temp\ipykernel_18204\2166202986.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ds[1] = 29

Name       Alice
Age           29
Gender    Female
Name: 0, dtype: object

In [17]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
df.loc[0][1] = 31
df

C:\Users\santa\AppData\Local\Temp\ipykernel_18204\1537522244.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[0][1] = 31

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [19]:
import lxml

In [20]:
url_data = pd.read_html("https://en.wikipedia.org/wiki/List_of_IMF_ranked_countries_by_GDP")

In [21]:
type(url_data)

list

In [22]:
len(url_data)

5

In [23]:
type(url_data[0])

pandas.core.frame.DataFrame

In [24]:
df1 = url_data[0]
df1.head()

    0                                                  1
0 NaN  This article needs to be updated. Please help ...

In [25]:
df1 = url_data[1]
df1.head()

,Country,GDP (nominal)(M$),GDP (nominal)per capita ($),GDP (PPP)(M$),GDP (PPP)per capita ($),Population(thousand),PPP2
0,Afghanistan,19454,582,66654,1996,33400,29
1,Albania,11866,4126,33997,11821,2876,35
2,Algeria,159046,3902,609610,14955,40762,26
3,Angola,95335,3485,185966,6797,27360,51
4,Antigua and Barbuda,1460,16176,2288,25346,90,64

In [26]:
df2 = url_data[2]
df2.head()

,Country,GDP (nominal)(M$),GDP (nominal) per capita ($),GDP (PPP)(M$),GDP (PPP)per capita ($),Population(thousand),PPP2
0,Afghanistan,19687,615,62009,1937,32007,32
1,Albania,11401,3946,32660,11304,2889,35
2,Algeria,166838,4175,580739,14532,39963,29
3,Angola,102962,3876,184830,6958,26563,56
4,Antigua and Barbuda,1259,14100,2101,23523,89,60

In [27]:
name = pd.Series(['Alice', 'Bob', 'Claire'])
age = pd.Series([25, 30, 27])
gender = pd.Series(['Female', 'Male', 'Female'])

In [28]:
new_df = pd.DataFrame({
    'Name' : name,
    'Age'  : age,
    'Gender': gender
})
new_df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
new_df = pd.concat([name, age, gender], keys = ['Name','Age', 'Gender'], axis=1)
new_df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [30]:
name = pd.Series(['Alice', 'Bob', 'Claire'], name = "Name")
age = pd.Series([25, 30, 27], name = 'Age')
gender = pd.Series(['Female', 'Male', 'Female'], name = 'Gender')

df = pd.concat([name, age, gender], axis=1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female